Autodesk.Revit.DB.InstanceBinding.#ctor(Autodesk.Revit.DB.CategorySet)
Constructs an instance binding with the set of categories passed.
Remarks: Categories can be set or changed at a later time by using the Categories property of this object.

Autodesk.Revit.DB.InstanceBinding.#ctor
Constructs an empty instance binding.
Remarks: Categories can be set a later time by using the Categories property of this object.

Autodesk.Revit.DB.InstanceBinding
The InstanceBinding object is used to signify a binding between a parameter
definition and a parameter on each instance of an element, such as a wall.
Remarks: Once bound the parameter will appear on all instance of the element and changing
the parameter on any one single instance will not change the value on any other instance.